class NameSkillBase:
    list_names: list = ()

    # вернуть список из имен (для использования в моделях choice=)
    def get_choice(self):
        return [(x, x) for x in self.list_names]

    # Вернуть все имена
    def get_list(self):
        return self.list_names


# Список общих навыков
class NamesOther(NameSkillBase):
    list_names = (
        {'name': 'Азартные игры', 'attr': 'Интеллект', 'spec': ''},
        {'name': 'Атлетика', 'attr': 'Проворство', 'spec': ''},
        {'name': 'Артистизм', 'attr': 'Харизма', 'spec': 'Актерство'},
        {'name': 'Артистизм', 'attr': 'Харизма', 'spec': 'Комедия'},
        {'name': 'Артистизм', 'attr': 'Харизма', 'spec': 'Пение'},
        {'name': 'Артистизм', 'attr': 'Харизма', 'spec': 'Сказительство'},
        {'name': 'Верховая езда', 'attr': 'Проворство', 'spec': 'Гигантские волки'},
        {'name': 'Верховая езда', 'attr': 'Проворство', 'spec': 'Грифоны'},
        {'name': 'Верховая езда', 'attr': 'Проворство', 'spec': 'Демигрифы'},
        {'name': 'Верховая езда', 'attr': 'Проворство', 'spec': 'Лошади'},
        {'name': 'Верховая езда', 'attr': 'Проворство', 'spec': 'Пегасы'},
        {'name': 'Вождение', 'attr': 'Проворство', 'spec': ''},
        {'name': 'Выживание', 'attr': 'Интеллект', 'spec': ''},
        {'name': 'Гребля', 'attr': 'Сила', 'spec': ''},
        {'name': 'Запугивание', 'attr': 'Сила', 'spec': ''},
        {'name': 'Интуиция', 'attr': 'Инициатива', 'spec': ''},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Гравюра'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Живопись'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Картография'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Мозаика'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Скульптура'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Татуировка'},
        {'name': 'Искусство', 'attr': 'Ловкость', 'spec': 'Ткачество'},
        {'name': 'Кутеж', 'attr': 'Выносливость', 'spec': ''},
        {'name': 'Лазанье', 'attr': 'Сила', 'spec': ''},
        {'name': 'Лидерство', 'attr': 'Харизма', 'spec': ''},
        {'name': 'Наблюдательность', 'attr': 'Инициатива', 'spec': ''},
        {'name': 'Обаяние', 'attr': 'Харизма', 'spec': ''},
        {'name': 'Ориентирование', 'attr': 'Инициатива', 'spec': ''},
        {'name': 'Подкуп', 'attr': 'Харизма', 'spec': ''},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Основное'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Двуручное'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Древковое'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Кавалерийское'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Кулачное'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Парирующее'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Фехтовальное'},
        {'name': 'Рукопашный бой', 'attr': 'Ближний бой', 'spec': 'Цепы'},
        {'name': 'Скрытность', 'attr': 'Проворство', 'spec': 'Города'},
        {'name': 'Скрытность', 'attr': 'Проворство', 'spec': 'Дикая природа'},
        {'name': 'Скрытность', 'attr': 'Проворство', 'spec': 'Подземелья'},
        {'name': 'Сплетничество', 'attr': 'Харизма', 'spec': ''},
        {'name': 'Стойкость', 'attr': 'Выносливость', 'spec': ''},
        {'name': 'Торговля', 'attr': 'Харизма', 'spec': ''},
        {'name': 'Уклонение', 'attr': 'Проворство', 'spec': ''},
        {'name': 'Усмирение животных', 'attr': 'Сила воли', 'spec': ''},
        {'name': 'Хладнокровие', 'attr': 'Сила воли', 'spec': ''},
    )



n = NamesOther()
print(n.get_choice())


class NamesProfessional(NameSkillBase):

    list_names = (
        'Взлом', 'Выслеживание', 'Дрессировка (Голуби)', 'Дрессировка (демигрифы)', 'Дрессировка (лошади)',
        'Дрессировка (пегасы)', 'Дрессировка (собаки)', 'Знание (геология)', 'Знание (геральдика)', 'Знание (закон)',
        'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', 'Знание ()', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    )